Repository: hpb-htw/python-beginners-sphinx8
Catalog: source/locale/*/LC_MESSAGES/conditional_loops.po
Languages: de

source: Conditional Loops
de: Bedingte Schleifen

source: Introduction
de: Einführung

source: Conditional loops are way to repeat something while a certain condition is satisfied, or **True**. If the condition is always satisfied (never becomes **False**), the loop can become infinite. If the condition starts off false, the code in the loop will never run! In Python conditional loops are defined with the ``while`` statement::
de: Bedingte Schleifen sind ein Weg etwas zu wiederholen, solange eine bestimmte Bedingung erfüllt, oder **True**, ist. Falls die Bedingung immer erfüllt ist (also nie **False** wird), läuft die Schleife endlos weiter. Falls die Bedingung schon anfänglich falsch ist, wird der Code in der Schleife niemals ausgeführt! In Python werden bedingte Schleifen mit der ``while``\ -Anweisung definiert::

source: We call this part of the code the 'conditional': ``'.' not in word``
de: Wir nennen diesen Teil des Quelltextes die 'Bedingung': ``'.' not in word``

source: Whether the conditional returns True or not determines whether the code inside the ``while`` loop runs. Of course, it repeats the check every time the loop is run again.
de: Ob die Bedingung wahr (True) zurückgibt oder nicht entscheidet, ob der Quelltext innerhalb der ``while``\ -Schleife ausgeführt wird.

source: Read the code above, and see if you can summarise in your head what it should do (what its final output will be).
de: Lies den obigen Quellcode und schau, ob du im Kopf herleiten kannst, was er tut (und was die endgültige Ausgabe sein wird).

source: Then copy it into a file, say :file:`sentence.py` and run it - see exactly what it does. Does that match up with what you thought?
de: Dann kopier ihn in eine Datei, sagen wir :file:`satz.py`, und führe ihn aus -- schau genau, was er tut. Trifft das, was du dir gedacht hast, zu?

source: Turtle prison
de: Schildkrötengefängnis

source: Exercise
de: Übung

source: ``turtle.distance(0, 0)`` - Returns the distance of the turtle from the origin (0, 0)
de: ``turtle.distance(0, 0)``- Entfernung der Schildkröte vom Ursprung

source: ``turtle.towards(0, 0)`` - Returns the angle to get back to origin (0, 0)
de: ``turtle.towards(0, 0)`` - Der Winkel, der zurück zum Ursprungspunkt führt

source: ``turtle.setheading(angle)`` - Directly sets the turtle's direction
de: ``turtle.setheading(Winkel)`` - Lege die Ausrichtung der Schildkröte direkt fest

source: You could try playing with a turtle in the interpreter and using these functions to check exactly what they do, if you like.
de: Du kannst, wenn du magst, versuchen, mit der turtle in einem Interpreter herumzuspielen und die Funktionen zu benutzen, um genau zu sehen, was sie tut.

source: Now you will need to implement the prison logic using these turtle functions, perhaps a ``while`` loop and a bit of conditional logic. It's a bit of a stretch but keep at it! Don't be afraid to talk it out with a coach or another student.
de: Jetzt wirst du die Gefängnislogik implementieren müssen, indem du die turtle-Funktionen, vielleicht eine ``while``\ -Schleife und ein bisschen bedingte Logik, verwendest. Es ist ein bisschen haarig, aber bleib dran! Scheue nicht davor zurück, deine Idee mit einem Coach oder einem anderen Lernenden durchzusprechen.

source: Solution
de: Lösung

source: Draw a spiral
de: Zeichne eine Spirale

source: Loops can be interrupted with the ``break`` statement. This is especially useful if you write an *infinite loop*, which is a loop where the conditional is always **True**.
de: Schleifen können mit der ``break``\ -Anweisung unterbrochen werden. Das ist besonders nützlich, wenn du eine *Endlosschleife* schreibst, welches eine Schleife ist, deren Bedingung immer wahr (**True**) ist.

source: Write a ``while`` loop with a condition that is always **True** to draw a spiral. Interrupt the loop when the turtle reaches a certain distance from the center. Use the function ``turtle.distance(x, y)`` to get the turtle's distance to the point defined by the coordinates ``x`` and ``y``.
de: Schreibe eine ``while``\ -Schleife mit einer Bedingung, die immer wahr (**True**) ist, um eine Spirale zu malen. Unterbrich die Schleife, wenn die turtle eine gewisse Distanz zum Mittelpunkt erreicht hat. Benutze die Funktion ``turtle.distance(x, y)``, um die Entfernung der Schildkröte zu dem durch die ``x``\ - und ``y``\ -Koordinaten bestimmten Punkt zu errechnen.

source: To do this you will need the ``turtle.xcor()`` and ``turtle.ycor()`` functions, which return the position of the turtle in X and Y axes respectively.
de: Um das zu tun, brauchst Du die Funktionen ``turtle.xcor()`` und ``turtle.ycor()``, welche die Position der Schildkröte auf der X- und Y-Achse zurückgeben.

source: To draw a spiral, the turtle has to rotate by a constant value and move forward by an increasing value.
de: Um eine Spirale zu zeichnen, muss die Schildkröte um einen konstanten Winkel gedreht werden und dabei um eine anwachsende Strecke vorwärts bewegt werden.

source: Can you make a conditional for this loop, so you don't need the infinite loop ``while True`` or the ``break``? Which version do you find easier to understand?
de: Kannst du eine Bedingung für die Schleife formulieren, so dass du du keine Endlosschleife ``while True`` oder die ``break``\ -Anweisung benötigst? Welche Version findest du einfacher zu verstehen?
