Repository: hpb-htw/python-beginners-sphinx8
Catalog: source/locale/*/LC_MESSAGES/getting_started.po
Languages: de

source: Getting started
de: Erste Schritte

source: What you'll need
de: Was du brauchst

source: A Python!
de: Eine Python!

source: If you haven't yet got python, the latest official installation packages can be found here:
de: Falls Du Python noch nicht installiert hast, findest Du die jüngsten offiziellen Installationspakete hier:

source: Python 3 is preferable, being the newest version out!
de: Python 3 ist zu bevorzugen, da es die neueste verfügbare Version ist!

source: On Windows, you'll need to add :program:`Python` to your ``%PATH%``, so it can be found by other programs.
de: Unter Windows wirst du :program:`Python` zu deinem Systempfad hinzufügen wollen, sodass es von anderen Programmen gefunden werden kann.

source: When installing Python 3.5 or later, there should be tick box option to do this on the first page of the installer. Make sure you tick this on.
de: Bei der Installation von Python 3.5 oder höher sollte auf der ersten Seite des Installationsprogramms ein entsprechendes Kontrollkästchen verfügbar sein. Aktiviere dieses Kontrollkästchen.

source: Otherwise, you can navigate to your installation directory (``C:\Python34\``), open the ``Tools``, then ``Scripts`` folder, and run the ``win_add2path.py`` file by double clicking on it.
de: Andernfalls kannst Du zu Deinem Installationsverzeichnis (``C:Python34``) navigieren, den Ordner ``Tools`` und dann ``Scripts`` öffnen und die Datei ``win_add2path.py`` durch Doppelklicken ausführen.

source: And a Code Editor
de: Und einen Quelltext-Editor

source: A code editor helps with reading and writing programming code. There are many around, and it is one of the most personal choices a programmer can make - Like a tennis-player choosing their racket, or a chef choosing their favourite knife. To start off with, you'll just want a basic, easy-to-use one that doesn't get in your way, but is still effective at writing python code. Here are some suggestions for those:
de: Ein Quelltext-Editor erlaubt das Lesen und Schreiben von Programmen. Es gibt viele, und es ist eine sehr persönliche Wahl -- wie ein Tennisspieler seinen Schläger oder ein Koch sein Lieblingsmesser wählt. Um anzufangen benötgist du nur einen simplen, einfach zu benutzenden Editor der dir nicht in die Quere kommt, aber immer noch effektiv beim Schreiben vom Pythonquelltext ist. Hier sind ein paar Vorschläge:

source: `Sublime Text`_: Windows, Mac & Linux. A great all around editor that's easy to use. It's Ctl+B shortcut lets you run the python file you're working on straight away.
de: `Sublime Text`_: Ein großartiger Allzweckeditor der einfach zu benutzen ist. Sein Ctrl+B Tastaturkürzel lässt dich Pythondateien an denen du arbeitest direkt ausführen. Läuft auf Windows, Mac und Linux.

source: What is Python, exactly?
de: Was ist Python eigentlich?

source: Ok, so python is this thing called a **programming language**. It takes text that you've written (usually referred to as **code**), turns it into instructions for your computer, and runs those instructions. We'll be learning how to write code to do cool and useful stuff. No longer will you be bound to use *others'* programs to do things with your computer - you can make your own!
de: Also, Python ist etwas, das **Programmiersprache** genannt wird. Es liest Text ein den Du geschrieben hast (üblicherweise als **Code** bezeichnet), verwandelt ihn in Befehle für den Computer und führt diese aus. Wir werden lernen Code zu schreiben, der coole und nützliche Dinge tut. Du wirst nicht länger daran gebunden sein, Programme von anderen Leuten zu verwenden um mit Deinem Computer Dinge zu tun.

source: Practically, Python is just another program on your computer. The first thing to learn is how to use and interact with it. There are in fact many ways to do this; the first one to learn is to interact with python's interpreter, using your **operating system's** (OS) console.
de: Python ist praktisch einfach ein weiteres Programm auf Deinem Computer. Zuerst werden wir lernen Python zu benutzen und mit ihm zu interagieren. Es gibt mehrere Wege das zu tun; der erste ist mit dem Python Interpreter über die Textkonsole Deines **Betriebssystems** zu interagieren.

source: A **console** (or 'terminal', or 'command prompt') is a *textual* way to interact with your OS, just as the 'desktop', in conjunction with your mouse, is the *graphical* way to interact your system.
de: Eine **Konsole** (auch 'Terminal' oder 'Prompt') ist ein *schriftlicher* Weg mit Deinem Betriebssystem zu interagieren, so wie der 'Desktop' zusammen mit Deiner Maus ein *grafischer* Weg zu Deinem System ist.

source: Opening a console on Mac OS X
de: Eine Konsole auf Mac OS X öffnen

source: OS X's standard console is a program called :program:`Terminal`. Open Terminal by navigating to Applications, then Utilities, then double-click the :program:`Terminal` program. You can also easily search for it in the system search tool in the top right.
de: Die Standardkonsole in OS X heißt :program:`Terminal`. Öffne Terminal indem du nach Applications navigierst, dann nach Utilities und dort doppelt auf das :program:`Terminal`\ -Programm klickst. Du kannst es auch durch die Systemsuche oben rechts suchen.

source: The command line Terminal is a tool for interacting with your computer. A window will open with a command line prompt message, something like this::
de: Das Kommandozeilenterminal ist ein Werkzeug um mit Deinem Computer zu interagieren. Ein Fenster mit einer Nachricht und einem Prompt öffnet sich, ähnlich zu folgendem:

source: Opening a console on Linux
de: Eine Konsole unter Linux öffnen

source: Different linux distributions (e.g Ubuntu, Fedora, Mint) may have different console programs, usually referred to as a terminal. The exact terminal you start up, and how, can depend on your distribution. On Ubuntu, you will likely want to open :program:`Gnome Terminal`. It should present a prompt like this::
de: Verschiedene Linuxdistributionen (bspw. Ubuntu, Fedora, Mint) können unterschiedliche Konsolenprogramme haben, die üblicherweise Terminal genannt werden. Welches du genau startest, und wie, hängt von deiner Distribution ab. Unter Ubuntu wirst du vermutlich das :program:`Gnome Terminal` öffnen wollen. Es sollte eine Aufforderung in folgendem Stil erscheinen::

source: Opening a console on Windows
de: Eine Konsole unter Windows öffnen

source: Window's console is called the Command Prompt, named :program:`cmd`. An easy way to get to it is by using the key combination :kbd:`Windows+R` (:kbd:`Windows` meaning the windows logo button), which should open a :guilabel:`Run` dialog. Then type :program:`cmd` and hit :kbd:`Enter` or click :guilabel:`Ok`. You can also search for it from the start menu. It should look like::
de: Die Windows-Konsole wird Eingabeaufforderung genannt, oder :program:`cmd`. Ein leichter Weg zu ihr zu gelangen ist die Tastenkombination :kbd:`Windows+R` (:kbd:`Windows` meint den Knopf mit dem Windows-Logo), welches den :guilabel:`Ausführen`\ -Dialog öffnen sollte. Gib dann :program:`cmd` ein und drück :kbd:`Enter` oder klick auf :guilabel:`Ok`. Du kannst sie auch aus dem Startmenü heraussuchen. Sie sollte in etwa so aussehen::

source: Window's Command Prompt is not quite as powerful as its counterparts on Linux and OS X, so you might like to start the Python Interpreter (see just below) directly, or using the :program:`IDLE` program that Python comes with. You can find these in the Start menu.
de: Die Windows Kommandozeilenaufforderung ist nicht ganz so mächtig wie ihre Entsprechungen unter Linux und OS X, also möchtest du vielleicht den Python Interpreter (siehe unten) direkt ausführen, oder das IDLE-Programm das mit Python mitkommt. Du kannst sie im Startmenü finden.

source: Using Python
de: Python verwenden

source: The python program that you have installed will by default act as something called an **interpreter**. An interpreter takes text commands and runs them as you enter them - very handy for trying things out.
de: Das Pythonprogramm das du installiert hast agiert standardmäßig als etwas das sich **Interpreter** nennt. Ein Interpreter nimmt Befehle entgegen und führt sie dann aus -- sehr praktisch um Dinge auszuprobieren.

source: Just type :program:`python` at your console, hit :kbd:`Enter`, and you should enter Python's Interpreter.
de: Tippe in deiner Konsole :program:`python` ein, drücke :kbd:`Enter` und der Python-Interpreter sollte starten.

source: To find out which version of python you're running, instead type ``python -V`` in your console to tell you.
de: Um herauszufinden welche Version von Python du hast, benutz ``python -V`` um es dir sagen zu lassen.

source: Interacting With Python
de: Mit Python interagieren

source: After Python opens, it will show you some contextual information similar to this::
de: Sobald Python startet, zeigt es Dir einige Kontextinformationen ähnlich zu diesen::

source: The prompt **>>>** on the last line indicates that you are now in an interactive Python interpeter session, also called the "Python shell". **This is different from the normal terminal command prompt!**
de: Der Prompt **>>>** in der letzten Zeile signalisiert dass Du Dich nun in der interaktiven Python Konsole befindet, auch ''Python Shell'' genannt. **Diese Konsole ist etwas anderes als das normale Kommandozeilenterminal!**

source: An extremely useful command is ``help()``, which enters a help functionality to explore all the stuff python lets you do, right from the interpreter. Press :kbd:`q` to close the help window and return to the Python prompt.
de: Ein extrem nützlicher Befehl ist ``help()``, welcher eine Hilfefunktion startet um all die Dinge herauszufinden, die Python dich machen lässt, direkt im Interpreter. Drücke :kbd:`q` um das Hilfefenster wieder zu schließen

source: To leave the interactive shell and go back to the console (the *system* shell), press :kbd:`Ctrl-Z` and then :kbd:`Enter` on Windows, or :kbd:`Ctrl-D` on OS X or Linux. Alternatively, you could also run the python command ``exit()``!
de: Um die Python Shell zuverlassen, drücke :kbd:`Ctrl-Z` und :kbd:`Enter` unter Windows, oder :kbd:`Ctrl-D` unter OS X oder Linux. Alternativ kannst Du auch den Python-Befehl ``exit()`` ausführen.

source: Running Python files
de: Pythonprogramme ausführen

source: When you have a lot of python code to run, you will want to save it into a file, so for instance, you can modify small parts of it (fix a bug) and re-run the code without having to repeatedly re-type the rest. Instead of typing commands in one-by-one you can save your code to a file and pass the file name to the :program:`python` program. It will execute that file's code instead of launching its interactive interpreter.
de: Falls du viel Pythonquelltext auszuführen hast wirst du ihn in eine Datei speichern wollen damit du zum Beispiel kleine Stücke verändern kannst (einen Fehler beheben) und es nochmal ausführen kannst ohne den Rest wieder und wieder einzutippen. Stattdessen kannst du deinen Quelltext in eine Datei speichern und den Dateinamen an das :program:`python`\ -Programm liefern. Es wird dann diese Datei ausführen statt den interaktiven Interpreter auszuführen.

source: On Windows you should also be able to double-click the Python file to run it.
de: Unter Windows solltest du doppelt auf die Pythondatei klicken können um sie auszuführen.

source: When pressing :kbd:`Enter` now, the file is executed and you see the output as before. But this time, after Python finished executing all commands from that file it exits back to the system command prompt, instead of going back to the interactive shell.
de: Wenn du jetzt :kbd:`Enter` drückst, wird die Datei ausgeführt und du siehst ihre Ausgabe wie vorher. Aber diesmal, nachdem Python fertig ist all die Befehle aus der Datei auszuführen, wird es zur System-Eingabeaufforderung zurückkehren, statt zur interaktiven Shell zurückzugehen.

source: And now we are all set and can get started with turtle!
de: Wir sind jetzt startklar und können mit der Schildkröte anfangen!

source: Not getting "Hello world" but some crazy error about "can't open file" or "No such file or directory?" Your command line might not be running in the directory that you saved the file in. You can change the working directory of your current command line with the :command:`cd` command, which stands for "change directory". On Windows, you might want something like::
de: Du siehst kein "Hello world" sondern irgendeinen komischen Fehler wie "can't open file" oder "No such file or directory"? Vielleicht befindet sich deine Kommandozeile nicht in dem Ordner, in dem du die Datei gespeichert hast. In der Kommandozeile kannst du den Befehl :command:`cd` ("change directory") benutzen um deinen ausgewählten Ordner zu wechseln. Unter Windows kannst du folgendes ausprobieren::

source: On Linux or OS X, you might want something like:
de: Unter Linux und OS X möchtest du etwas wie:

source: This changes to the directory Python_Exercises under the Desktop folder (yours might be somewhere different). If you don't know the location of the directory where you saved the file, you can simply drag the directory to the command line window. If you don't know which directory your shell is currently running in use :command:`pwd`, which stands for "print working directory".
de: Dieser Befehl wechselt in das Verzeichnis Python_Exercises innerhalb des Desktop-Ordners (auf Deinem Computer heißt dieser eventuell anders). Falls Du nicht weisst in welchem Verzeichnis Du die Textdatei mit dem Programm abgespeichert hast, kannst Du einfach das Ordnersymbol in das Terminalfenster ziehen. Falls Du nicht weisst in welchem Verzeichnis sich Deine Textkonsole grade befindet, verwende den Befehl :command:`pwd`, der für "print working directory" steht.

source: When playing around with turtle, avoid naming your file :file:`turtle.py` --- rather use more appropriate names such as :file:`square.py` or :file:`rectangle.py`. Otherwise, whenever you refer to ``turtle``, Python will pick up *your* file instead of the standard Python turtle module.
de: Wenn Du mit dem turtle-Modul experimentierst, vermeide es Deine Datei :file:`turtle.py` zu nennen --- verwende lieber Namen wie :file:`quadrat.py` oder :file:`rechteck.py`. Andernfalls wird Python jedesmal wenn Du den Namen ``turtle`` verwendest, *Deine* Datei anstatt dem Modul turtle verwenden.
